[
    {
      "date": "2024-07-02",
      "topic": "Banking & Finance",
      "title": "ICICI Lombard launches surety insurance for infra sector",
      "points": [
        "Launch of: Surety Insurance",
        "Launched by: ICICI Lombard",
        "Reason: To provide risk mitigation solutions for India’s burgeoning infrastructure sector.",
        "What is Surety insurance?",
        "It acts as a guarantee to a beneficiary (typically an authority or client) that a principal debtor (usually a contractor) will fulfil their contractual obligations.",
        "If the contractor fails to honour the terms or contractual commitments, the surety insurance provider will provide financial compensation to the beneficiary."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Banking & Finance",
      "title": "SBI launches web-based digital business loans solution for MSMEs’ invoice financing",
      "points": [
        "Launch of: MSME -Sahaj",
        "Launched by: State Bank of India (SBI)",
        "MSME -Sahaj:",
        "A web-based digital business loans solution for MSMEs’ (micro, small and medium enterprises) invoice financing.",
        "The Bank’s customers can avail finance against their Goods and Service Tax (GST) registered sales invoices of up to ₹1 lakh in less than 15 minutes.",
        "Aim: To provide “on tap” short-term credit for working capital needs to MSME units who are part of the GST regime."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Banking & Finance",
      "title": "Bank of Baroda receives ₹1,068 crore demand order from IT Dept",
      "points": [
        "Bank: Bank of Baroda",
        "Notice received: ₹1,068 crore demand order from IT Dept",
        "Year: Assessment Year (AY) 2017-18",
        "Received a demand order under section 156 of the Income Tax Act, 1961."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Banking & Finance",
      "title": "RBI joins ‘Project Nexus’ to enable instant cross-border retail payments",
      "points": [
        "Name of Project: Project Nexus",
        "Joined by: The Reserve Bank of India (RBI)",
        "Aim: To enable instant cross-border retail payments by interlinking domestic Fast Payments Systems (FPSs)",
        "What is Project Nexus?",
        "It was conceptualized by the Innovation Hub of the Bank for International Settlements (BIS)",
        "Aim: To connect the FPSs of four ASEAN countries (Malaysia, Philippines, Singapore, and Thailand); and India",
        "An agreement to this effect was signed by the BIS and the Central Banks of the founding countries -- Bank Negara Malaysia (BNM), Bank of Thailand (BOT), Bangko Sentral ng Pilipinas (BSP), Monetary Authority of Singapore (MAS), and RBI on June 30, 2024, in Basel, Switzerland.",
        "The platform is expected to go live by 2026."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Banking & Finance",
      "title": "ADB & Aadhar housing partners to give housing loans to low-income women",
      "points": [
        "Signed between: Asian Development Bank (ADB) and Aadhar Housing Finance Limited (AHFL)",
        "Amount: USD 60 million nonconvertible debentures financing agreement",
        "Reason: To provide housing loans to women and address the shortage of financing in the low-income and affordable housing segment in India.",
        "Half of the funds will be deployed in Bihar, Chhattisgarh, Jharkhand, Madhya Pradesh, Odisha, Rajasthan, Uttar Pradesh, and West Bengal.",
        "AHFL is a housing finance company in India focused on the low-income housing segment, with loan sizes under 1.5 million Indian rupees (around USD 17,976)."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Banking & Finance",
      "title": "Home loan outstanding grew by 3.4 lakh crore in last one year: RBI",
     "points": [
        "Report by: The Reserva Bank of India (RBI)",
        "Credit growth for housing loans: Accelerated by 16.9% to reach Rs 23.49 lakh crore, up from Rs 20.09 lakh crore a year earlier, marking a 13.8% growth",
        "The growth in home loan was up by 13.8% with a total of Rs 20.09 lakh crore in May 2024 as compared to last year.",
        "Growth rate of personal loans: Decreased to 17.8% year-on-year in May 2024, down from 19.1% compared to the previous year.",
        "Credit card outstanding in May this year increased by 26.2% to about Rs 55,000 crore, reaching Rs 2.67 lakh crore.",
        "On a year-on-year basis, non-food bank credit rose by 16.2% to Rs 162.30 lakh crore in May 2024, compared to a growth of 15.5% in the previous year."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Banking & Finance",
      "title": "Union Bank of India Introduces “Union Premier” Branches",
      "points": [
        "Launch of: “Union Premier” Branches",
        "Launched by: Union Bank",
        "Target area: Rural and Semi-Urban Markets",
        "Offer: Personalized banking with dedicated Relationship Managers, advanced digital solutions",
        "MD and CEO of Union Bank of India: A.Manimekhalai"
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Banking & Finance",
      "title": "Bank of Maharashtra launches VKYC for remote account opening",
      "points": [
        "Launch of: Video Based Customer Identification Process (V-KYC)",
        "Launched by: Bank of Maharashtra",
        "Target area: For remote account opening",
        "Aim: To allow customers to open savings account from any remote place, eliminating the need for branch visits and paperwork"
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Banking & Finance",
      "title": "GST collection at Rs 1.74 trillion in June 2024",
      "points": [
        "GST collection June 2024: Rs 1.74 trillion",
        "7.7 per cent year-on-year (YoY) growth",
        "Notably less than the 12.4% and 10% increases recorded in April and May, respectively.",
        "April 2024 witnessed a record-high GST collection of Rs 2.1 trillion.",
        "The GST taxpayer base increased to 14.6 million in April 2024",
        "Note: The finance ministry has now decided to discontinue the publication of detailed tax collection numbers."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Banking & Finance",
      "title": "World Bank Approves 1.5 Billion Dollars To Accelerate Development Of Low-Carbon Energy",
      "points": [
        "Amount of loan: 1.5 Billion Dollars",
        "Receiver: India",
        "Approved by: World Bank",
        "Reason: To accelerate the development of low-carbon energy",
        "Phase: Second phase",
        "The financing is extended to promote a market for green hydrogen, electrolysers, and increased renewable energy penetration.",
        "The development comes in the backdrop of India’s ambitious National Green Hydrogen Mission and energy transition targets.",
        "The Centre has set a target of achieving 500 GW of installed renewable energy capacity by 2030 and reaching net zero by 2070."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Banking & Finance",
      "title": "CBIC initiates electronic disbursal of duty drawback amount",
      "points": [
        "Launched of: Electronically disburse duty drawback amount",
        "Launched by: Central Board of Indirect Taxes and Customs (CBIC)",
        "The payment of duty drawback amounts into the exporters' accounts will be facilitated through the Public Finance Management System (PFMS) automatically.",
        "This is another initiative of the CBIC towards paperless Customs and enhanced trade facilitation.",
        "This new functionality is expected to reduce time taken for payment of drawback amount by eliminating manual intervention in the drawback disbursal mechanism and increase transparency."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "National",
      "title": "GAIL fast-tracks net zero carbon goal to 2035 from 2040",
      "points": [
        "GAIL (India) Ltd has revised its target to achieve net zero carbon emissions to 2035 from 2040.",
        "GAIL Board accorded approval to advance its net zero target for Scope-I and 2 emissions by five years.",
        "Scope 1: Emissions from sources that an organisation owns or controls directly. For example, from burning fuel in factories or even in its fleet of vehicles.",
        "Scope 2: Emissions that a company causes indirectly and that come from the energy it purchases and uses. For example, the emissions caused by generating electricity.",
        "GAIL chairman and managing director Sandeep Kumar Gupta"
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "National",
      "title": "Mospi sets up 26-member committee to decide new base year for GDP",
      "points": [
        "Ministry: Ministry of Statistics and Programme Implementation (Mospi)",
        "Members: 26-member Advisory Committee",
        "Recommendation on: National Accounts Statistics (ACNAS) to decide the base year for gross domestic product (GDP) data.",
        "Chairman: Biswanath Goldar, former professor of the Institute of Economic Growth",
        "Other members of the committee include GC Manna, former director general, central statistics office (CSO), professor Mausami Das, Delhi School of Economics, and Chetan Ghate, director, Institute of Economic Growth.",
        "The committee will have a tenure of five years or till the completion of next base year, whichever is later."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Defence",
      "title": "Indian Navy Joins World’s Largest Naval Exercise RIMPAC",
      "points": [
        "Exercise Name: Rim of the Pacific Exercise (RIMPAC) 2024",
        "This exercise is the world’s biggest international maritime warfare exercise",
        "Location: Hawaii",
        "Total nation: 29",
        "Indian Navy participation: The Indian Navy has deployed frontline warship INS Shivalik for the RIMPAC.",
        "The harbour phase of the exercise is taking place from June 27 to July 7.",
        "The RIMPAC exercise will run till August 1.",
        "The theme of RIMPAC 2024 is 'Partners: Integrated and Prepared.'"
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Defence",
      "title": "SEBEX 2, India’s New Explosive Revolutionizing Military Firepower",
      "points": [
        "India has introduced SEBEX 2, a highperformance explosive with a TNT equivalence of 2.01.",
        "Developed under the Make in India initiative by Economic Explosives Limited",
        "SEBEX 2 enhances the effectiveness of various munitions without increasing weight.",
        "Certified by the Indian Navy, SEBEX 2, SITBEX 1 and SIMEX 4 demonstrate India's growing capabilities in military technology.",
        "This offers significant export potential and enhances global security efforts."        
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Defence",
      "title": "Bangladesh Navy Signs Contract For ‘Made In India’ 800 Tons Ocean Going Tug With India’s GRSE",
      "points": [
        "Bangladesh Navy signed a contract for ‘Made in India’ 800 tons Ocean Going Tug with India’s Garden Reach Shipbuilding and Engineers.",
        "The signing coincides with the visit of India’s Chief of Naval Staff Admiral Dinesh K Tripathi to Bangladesh."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "States",
      "title": "Itanagar Woman Police Station Awarded With ISO 9001:2015 Certification",
      "points": [
        "The Woman Police Station, Itanagar, has been awarded with ISO 9001:2015 certification",
        "This was informed by the Superintendent of Police, Itanagar, Rohit Rajbir Singh.",
        "This recognition highlights the station’s commitment to dealing humanely and effectively with crimes against women and children.",
        "The ISO 9001:2015 certification is an international standard that signifies the implementation of a comprehensive quality management system."        
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "States",
      "title": "TN to promote Madurai, Thoothukudi, Tirunelveli, Virudhunagar as ‘Space Bay'",
      "points": [
        "The Tamil Nadu government is promoting the nearby districts of Madurai, Thoothukudi, Tirunelveli, and Virudhunagar as “Space Bay.”",
        "It plans to offer additional incentives to companies to accelerate development, according to Tamil Nadu Industrial Development Corporation (TIDCO).",
        "Note: The Kulasekarapattinam spaceport will be ready in two years to launch small satellites"
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "States",
      "title": "Jharkhand Cabinet approves financial assistance scheme for 45 lakh women",
      "points": [
        "Name of Scheme: Mukhya Mantri Bahan Beti Maiqui Swabalamban Protsahan Yojana",
        "Launched by: Jharkhand government",
        "Beneficiary: 45 lakh women",
        "Aim: To empower and make them self-reliant",
        "Each woman will receive Rs 1,000 per month",
        "The state government will bear Rs 5,500 crore annually for this initiative",
        "The scheme is applicable to women between 21 and 50 years of age.",
        "Income tax payees, government employees, EPF holders, and a few other categories are excluded from the scheme’s benefits"        
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Important Dates",
      "title": "National Doctor’s Day 2024",
      "points": [
        "Date: July 1",
        "The day was established to commemorate the birth and death anniversary of Dr. Bidhan Chandra Roy, a renowned physician and the second Chief Minister of West Bengal.",
        "The Government of India officially recognized this day in 1991."        
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Important Dates",
      "title": "National Chartered Accountant (CA) Day 2024",
      "points": [
        "CA Day is observed on July 1st every year.",
        "In 2024, it is marking the 76th anniversary of the founding of the Institute of Chartered Accountants of India (ICAI)."        
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Appointments",
      "title": "Ravi Agrawal Appointed CBDT Chief, Succeeds Nitin Gupta",
      "points": [
        "Ravi Agrawal, a 1988-batch IRS officer, has been appointed as the new chairman of the Central Board of Direct Taxes (CBDT).",
        "He succeeds Nitin Gupta, whose tenure ended on June 30, 2024.",
        "Agrawal’s appointment extends till June 2025, with a reappointment on a contract basis to ensure continuity in CBDT’s policy framework."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Appointments",
      "title": "LIC Chairman Siddhartha Mohanty redesignated managing director & CEO",
      "points": [
        "Life Insurance Corporation of India (LIC) has re-designated its chairman Siddhartha Mohanty as managing director (MD) and chief executive officer (CEO), with effect from June 30, 2024."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Appointments",
      "title": "RBI appoints Arnab Kumar Chowdhury, Charulatha S Kar as executive directors",
      "points": [
        "The Reserve Bank of India (RBI) announced the appointment of Arnab Kumar Chowdhury and Charulatha S Kar as executive directors.",
        "Chowdhury and Kar will look after three departments each.",
        "Kar has been appointed as Executive Director (ED) with effect from July 1 while Chowdhury has been appointed ED with effect from June 3, 2024."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Obituaries",
      "title": "Veteran Sri Lankan Tamil leader Sampanthan passes away",
      "points": [
        "R Sampanthan, a veteran Sri Lankan politician and a moderate Tamil leader, who relentlessly pursued a life of peace, justice and dignity for Tamil nationals in the island nation, passed away"
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Science & Technology",
      "title": "Japan's H3 Rocket Launches ALOS-4 Satellite",
      "points": [
        "The Japan Aerospace Exploration Agency (JAXA) launched the ALOS-4 Earth observation satellite aboard the H3 rocket.",
        "JAXA confirmed post-launch that the mission was successful.",
        "The H3 mission took off from the Tanegashima Space Center.",
        "The satellite separated from the launch vehicle approximately 16 minutes and 34 seconds into the mission.",
        "This was the second successful mission for the H3 rocket."
      ]
    },
    {
      "date": "2024-07-02",
      "topic": "Sports",
      "title": "George Wins the Austrian Grand Prix",
      "points": [
        "Mercedes’ George Russell won the Austrian Grand Prix, the 11th round of the 2024 Formula 1 world championship, after Max Verstappen and Lando Norris collided."
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "Banking & Finance",
      "title": "Bank Credit Growth Of 15.4% For FY25: India Ratings",
      "points": [
        "Agency: India Ratings",
        "Forecast: Loan growth of 15.4 per cent for Indian banks in FY25",
        "As of May 31, 2024:",
        "The credit growth of the banking system (excluding the merger of HDFC Ltd with HDFC Bank) was 16.1% year-on-year.",
        "Including the impact of the HDFC merger, the banking system's credit growth stood at 19.8%",
        "Deposit growth continued to lag behind credit growth at 15.3%."
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "Banking & Finance",
      "title": "Sebi proposes mandatory disclosure of riskadjusted returns for mutual funds",
      "points": [
        "Proposal: Mandatory disclosure of riskadjusted returns for mutual funds",
        "Proposed by: SEBI",
        "Aim: To help investors make informed investment decisions and also to limit the scope for mis-selling",
        "Risk-adjusted return (RAR): Represents a more holistic measure of the scheme's performance as it quantifies the amount of return generated by a mutual fund scheme for each unit of risk taken to achieve that return.",
        "To bring uniformity across different funds, Sebi has also proposed a methodology for the calculation of the information ratio for different categories of mutual fund schemes."
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "Banking & Finance",
      "title": "IBBI introduces digital forms for monitoring liquidation processes",
      "points": [
        "Agency: Insolvency and Bankruptcy Board of India",
        "Launched: A set of electronic forms under the Insolvency and Bankruptcy Code",
        "The new circular introduces forms LIQ 1 to LIQ 4, covering different stages of the liquidation process.",
        "Present process: The IPs submit the details regarding the liquidation process, to the board through emails, which is time-consuming and inefficient",
        "Aim: To ease the compliance burden for insolvency professionals",
        "These forms are crucial for the liquidation process under the Insolvency and Bankruptcy Code (IBC).",
        "Systematic and transparent record-keeping",
        "Different stages of LIQ 1 to LIQ 4:",
        "LIQ 1: Details from the commencement of liquidation to the public announcement ",
        "LIQ 2: Information from the public announcement to the progress report, including valuation, sale, and receipts ",
        "LIQ 3: Focuses on the period from the last progress report to the application for dissolution ",
        "LIQ 4: Deals with the distribution of proceeds and other final details post-dissolution order"        
      ]
    },    
    {
      "date": "2024-07-01",
      "topic": "Banking & Finance",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "Banking & Finance",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "Banking & Finance",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "Banking & Finance",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    },
    {
      "date": "2024-07-01",
      "topic": "",
      "title": "",
      "points": [
        ""
      ]
    }
  ]
  